Masmiseim36/nxpSDK/devices/MKE04Z1284/drivers/fsl_flash.h
};

/*@}*/

/*!
 * @name Flash API key
 * @{
 */
/*! @brief Constructs the four character code for the Flash driver API key. */
#if !defined(FOUR_CHAR_CODE)
#define FOUR_CHAR_CODE(a, b, c, d) (((d) << 24) | ((c) << 16) | ((b) << 8) | ((a)))
#endif

/*!
 * @brief Enumeration for Flash driver API keys.
 *
 * @note The resulting value is built with a byte order such that the string
 * being readable in expected order when viewed in a hex editor, if the value
 * is treated as a 32-bit little endian value.
 */
enum _flash_driver_api_keys
{
    kFLASH_ApiEraseKey = FOUR_CHAR_CODE('k', 'f', 'e', 'k') /*!< Key value used to validate all flash erase APIs.*/
};
/*@}*/

/*!
 * @brief Enumeration for supported flash user margin levels.
 */
typedef enum _flash_user_margin_value
{
    kFLASH_ReadMarginValueNormal = 0x0000U, /*!< Use the 'normal' read level for 1s.*/
    kFLASH_UserMarginValue1      = 0x0001U, /*!< Apply the 'User' margin to the normal read-1 level.*/
    kFLASH_UserMarginValue0      = 0x0002U, /*!< Apply the 'User' margin to the normal read-0 level.*/
} flash_user_margin_value_t;

/*!
 * @brief Enumeration for supported factory margin levels.
 */
typedef enum _flash_factory_margin_value
{
    kFLASH_FactoryMarginValue1 = 0x0003U, /*!< Apply the 'Factory' margin to the normal read-1 level.*/
    kFLASH_FactoryMarginValue0 = 0x0004U, /*!< Apply the 'Factory' margin to the normal read-0 level.*/
} flash_factory_margin_value_t;

/*!
 * @brief Enumeration for supported flash margin levels.
 */
typedef enum _flash_margin_value
{
    kFLASH_MarginValueNormal,  /*!< Use the 'normal' read level for 1s.*/
    kFLASH_MarginValueUser,    /*!< Apply the 'User' margin to the normal read-1 level.*/
    kFLASH_MarginValueFactory, /*!< Apply the 'Factory' margin to the normal read-1 level.*/
    kFLASH_MarginValueInvalid, /*!< Not real margin level, Used to determine the range of valid margin level. */
} flash_margin_value_t;

/*!
 * @brief Enumeration for the three possible flash security states.
 */
typedef enum _flash_security_state
{
    kFLASH_SecurityStateNotSecure,       /*!< Flash is not secure.*/
    kFLASH_SecurityStateBackdoorEnabled, /*!< Flash backdoor is enabled.*/
    kFLASH_SecurityStateBackdoorDisabled /*!< Flash backdoor is disabled.*/
} flash_security_state_t;

/*!
 * @brief Enumeration for the three possible flash protection levels.
 */
typedef enum _flash_protection_state
{
    kFLASH_ProtectionStateUnprotected, /*!< Flash region is not protected.*/
    kFLASH_ProtectionStateProtected,   /*!< Flash region is protected.*/
    kFLASH_ProtectionStateMixed        /*!< Flash is mixed with protected and unprotected region.*/
} flash_protection_state_t;

/*!
 * @brief Enumeration for various flash properties.
 */
typedef enum _flash_property_tag
{
    kFLASH_PropertyPflashSectorSize    = 0x00U, /*!< Pflash sector size property.*/
    kFLASH_PropertyPflashTotalSize     = 0x01U, /*!< Pflash total size property.*/
    kFLASH_PropertyPflashBlockSize     = 0x02U, /*!< Pflash block size property.*/
    kFLASH_PropertyPflashBlockCount    = 0x03U, /*!< Pflash block count property.*/
    kFLASH_PropertyPflashBlockBaseAddr = 0x04U, /*!< Pflash block base address property.*/
    kFLASH_PropertyPflashFacSupport    = 0x05U, /*!< Pflash fac support property.*/

    kFLASH_PropertyEepromTotalSize           = 0x15U, /*!< EEPROM total size property.*/
    kFLASH_PropertyFlashMemoryIndex          = 0x20U, /*!< Flash memory index property.*/
    kFLASH_PropertyFlashCacheControllerIndex = 0x21U, /*!< Flash cache controller index property.*/

    kFLASH_PropertyEepromBlockBaseAddr = 0x22U, /*!< EEPROM block base address property.*/
    kFLASH_PropertyEepromSectorSize    = 0x23U, /*!< EEPROM sector size property.*/
    kFLASH_PropertyEepromBlockSize     = 0x24U, /*!< EEPROM block size property.*/
    kFLASH_PropertyEepromBlockCount    = 0x25U, /*!< EEPROM block count property.*/
    kFLASH_PropertyFlashClockFrequency = 0x26U, /*!< Flash peripheral clock property.*/
} flash_property_tag_t;

/*!
 * @brief Constants for execute-in-RAM flash function.
 * _flash_execute_in_ram_function_constants
 */
enum
{
    kFLASH_ExecuteInRamFunctionMaxSizeInWords = 16U, /*!< The maximum size of execute-in-RAM function.*/
    kFLASH_ExecuteInRamFunctionTotalNum       = 2U   /*!< Total number of execute-in-RAM functions.*/
};

/*!
 * @brief PFlash protection status - full
 */
typedef struct _pflash_protection_status
{
    uint8_t fprotvalue; /*!< FPROT[7:0] .*/
} pflash_protection_status_t;

/*!
 * @brief Enumeration for the flash memory index.
 */
typedef enum _flash_memory_index
{
    kFLASH_MemoryIndexPrimaryFlash   = 0x00U, /*!< Current flash memory is primary flash.*/
    kFLASH_MemoryIndexSecondaryFlash = 0x01U, /*!< Current flash memory is secondary flash.*/
} flash_memory_index_t;

/*!
 * @brief Enumeration for the flash cache controller index.
 */
typedef enum _flash_cache_controller_index
{
    kFLASH_CacheControllerIndexForCore0 = 0x00U, /*!< Current flash cache controller is for core 0.*/
    kFLASH_CacheControllerIndexForCore1 = 0x01U, /*!< Current flash cache controller is for core 1.*/
} flash_cache_controller_index_t;

/*! @brief A callback type used for the Pflash block*/
typedef void (*flash_callback_t)(void);

/*!
 * @brief Enumeration for the two possible options of flash prefetch speculation.
 */
typedef enum _flash_prefetch_speculation_option
{
    kFLASH_prefetchSpeculationOptionEnable  = 0x00U,
    kFLASH_prefetchSpeculationOptionDisable = 0x01U
} flash_prefetch_speculation_option_t;

/*!
 * @brief Flash prefetch speculation status.
 */
typedef struct _flash_prefetch_speculation_status
{
    flash_prefetch_speculation_option_t instructionOption; /*!< Instruction speculation.*/
    flash_prefetch_speculation_option_t dataOption;        /*!< Data speculation.*/
} flash_prefetch_speculation_status_t;

/*!
 * @brief Flash cache clear process code.
 */
typedef enum _flash_cache_clear_process
{
    kFLASH_CacheClearProcessPre  = 0x00U, /*!< Pre flash cache clear process.*/
    kFLASH_CacheClearProcessPost = 0x01U, /*!< Post flash cache clear process.*/
} flash_cache_clear_process_t;

/*!
 * @brief Active flash protection information for the current operation.
 */
typedef struct _flash_protection_config
{
    uint32_t lowRegionStart;  /*!< Start address of flash protection low region.*/
    uint32_t lowRegionEnd;    /*!< End address of flash protection low region.*/
    uint32_t highRegionStart; /*!< Start address of flash protection high region.*/
    uint32_t highRegionEnd;   /*!< End address of flash protection high region.*/
} flash_protection_config_t;

/*!
 * @brief Active flash information for the current operation.
 */
typedef struct _flash_operation_config
{
    uint32_t convertedAddress;          /*!< A converted address for the current flash type.*/
    uint32_t activeSectorSize;          /*!< A sector size of the current flash type.*/
    uint32_t activeBlockSize;           /*!< A block size of the current flash type.*/
    uint32_t blockWriteUnitSize;        /*!< The write unit size.*/
    uint32_t sectorCmdAddressAligment;  /*!< An erase sector command address alignment.*/
    uint32_t sectionCmdAddressAligment; /*!< A program/verify section command address alignment.*/

    uint32_t programCmdAddressAligment; /*!< A program flash command address alignment.*/
} flash_operation_config_t;

/*!
 * @brief Flash execute-in-RAM command.
 */
typedef union
{
    uint32_t commadAddr;
    void (*callFlashCommand)(volatile uint8_t *FTMRx_fstat);
} function_run_command_t;

typedef union
{
    uint32_t bitOperationAddr;
    void (*callCommonBitOperationCommand)(volatile uint32_t *base,
                                          uint32_t bitMask,
                                          uint32_t bitShift,
                                          uint32_t bitValue);
} function_common_bit_operation_t;
/*!
 * @brief Flash execute-in-RAM function information.
 */
typedef struct _flash_execute_in_ram_function_config
{
    uint32_t activeFunctionCount;                           /*!< Number of available execute-in-RAM functions.*/
    function_run_command_t runCmdFuncAddr;                  /*!< Execute-in-RAM function: flash_run_command. */
    function_common_bit_operation_t CommonBitOperationAddr; /*! Execute-in-RAM function: flash_common_bit_operation. */
} flash_execute_in_ram_function_config_t;

/*! @brief Flash driver state information.
 *
 * An instance of this structure is allocated by the user of the flash driver and
 * passed into each of the driver APIs.
 */
typedef struct _flash_config
{
    uint32_t PFlashBlockBase;          /*!< A base address of the first PFlash block */
    uint32_t PFlashTotalSize;          /*!< The size of the combined PFlash block. */
    uint8_t PFlashBlockCount;          /*!< A number of PFlash blocks. */
    uint8_t FlashMemoryIndex;          /*!< 0 - primary flash; 1 - secondary flash*/
    uint8_t FlashCacheControllerIndex; /*!< 0 - Controller for core 0; 1 - Controller for core 1 */
    uint8_t Reserved0;                 /*!< Reserved field 0 */
    uint32_t PFlashSectorSize;         /*!< The size in bytes of a sector of PFlash. */
    flash_callback_t PFlashCallback;   /*!< The callback function for the flash API. */

    uint32_t *flashExecuteInRamFunctionInfo; /*!< An information structure of the flash execute-in-RAM function. */

    uint32_t EEpromTotalSize; /*!< For the FlexNVM device, this is the size in bytes of the EEPROM area which was
                                 partitioned from FlexRAM */
    /*!< For the non-FlexNVM device, this field is unused */

    uint32_t EEpromBlockBase; /*!< This is the base address of the Eeprom */
    /*!< For the non-Eeprom device, this field is unused */
    uint8_t EEpromBlockCount; /*!< A number of EEPROM blocks. */
    /*!< For the non-Eeprom device, this field is unused */
    uint8_t EEpromSectorSize; /*!< The size in bytes of a sector of EEPROM. */
    /*!< For the non-Eeprom device, this field is unused */
    uint8_t Reserved1[2];       /*!< Reserved field 1 */
    uint32_t PFlashClockFreq;   /*!< The flash peripheral clock frequency */
    uint32_t PFlashMarginLevel; /*!< The margin level*/
    flash_execute_in_ram_function_config_t executeInRamFunction;
} flash_config_t;

